Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མྱ་ངན་གྱི་ཟུག་རྔུ་མི་བཟད་པ་དང་ལྡན་པར་འགྱུར་རོ། །རབ་འབྱོར་གྱིས་གསོལ་པ་ཅི་ལགས། བཅོམ་ལྡན་འདས་བདུད་སྡིག་ཏོ་ཅན་གཅིག་འགའ་ཞིག་མྱ་ངན་གྱི་ཟུག་རྔུ་མི་བཟད་པས་ཟུག་པར་འགྱུར་རམ། འོན་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བདུད་སྡིག་ཏོ་ཅན་གང་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ཐམས་ཅད་མྱ་ངན་གྱི་ཟུག་རྔུ་མི་བཟད་པས་ཟུག་པར་འགྱུར།
en: Subhūti then asked, “Blessed Lord, will it be a single evil Māra that will be pierced by unbearable pains of sorrow, or will all the evil Māras that there are in the world system of the great trichiliocosm be pierced by unbearable pains of sorrow?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པས་རྣམ་པར་སྤྱོད་པའི་ཚེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བདུད་སྡིག་ཏོ་ཅན་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་མྱ་ངན་གྱི་ཟུག་རྔུ་མི་བཟད་པས་ཟུག་པར་འགྱུར་ཏེ། རང་རང་གི་སྟན་ལ་འདུག་མི་འདོད་དོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings engage by dwelling in the perfection of wisdom, all those evil Māras that there are in the world system of the great trichiliocosm will be pierced by unbearable pains of sorrow, and will feel disinclined to sit on their respective seats.

source: །དེ་ལྟར་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་གང་གི་ཕྱིར་དེ་བཟུང་ཞིང་ཕྱིར་བཟློག་པའི་གླགས་མི་རྙེད་གཏིང་མི་རྙེད་དོ།
en: Yet for bodhisattva great beings who engage in that way, there is nothing the world with its gods, humans, and asuras can do to seize them and turn them back.

source: །རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པས་རྣམ་པར་སྤྱད་པར་བྱ་སྟེ།
en: Therefore, Subhūti, bodhisattva great beings who wish swiftly to attain consummate buddhahood in unsurpassed, complete enlightenment should engage by dwelling in the perfection of wisdom. {

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣམ་པར་སྤྱོད་པས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Ki.V: 83} “Bodhisattva great beings who engage by dwelling in the perfection of wisdom will complete the cultivation of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: They will complete the cultivation of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Bodhisattva great beings who engage by dwelling in the perfection of wisdom will complete the cultivation of all the perfections.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how will bodhisattva great beings who engage by dwelling in the perfection of wisdom complete the cultivation of the perfection of generosity?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས།
en: How will they complete the cultivation of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་སྦྱིན་པ་དེ་དག་ཡོངས་སུ་གཏོང་སྟེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dispense their gifts, they dispense those gifts while dedicating them to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of generosity. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་སྲུང་བའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་ཚུལ་ཁྲིམས་དེ་དག་སྲུང་སྟེ།
en: Subhūti, if you ask how bodhisattva great beings will complete the cultivation of the perfection of ethical discipline, in this regard, Subhūti, when bodhisattva great beings maintain their ethical discipline, they maintain that ethical discipline while dedicating it to all-aspect omniscience.

source: དེ་ལྟར་ན་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of ethical discipline. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་བསྒྲུབ་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་བཟོད་པ་དེ་བསྒོམ་སྟེ།
en: Subhūti, if you ask how bodhisattva great beings will complete the cultivation of the perfection of tolerance, in this regard, Subhūti, when bodhisattva great beings cultivate tolerance, they cultivate that tolerance while dedicating it to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of tolerance. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་རྩོམ་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་བརྩོན་འགྲུས་དེ་བརྩམ་སྟེ།
en: Subhūti, if you ask how bodhisattva great beings will complete the cultivation of the perfection of perseverance, in this regard, Subhūti, when bodhisattva great beings undertake perseverance, they undertake that perseverance while dedicating it to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of perseverance. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་བསམ་གཏན་དེ་དག་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: Subhūti, if you ask how bodhisattva great beings will complete the cultivation of the perfection of meditative concentration, in this regard, Subhūti, when bodhisattva great beings are absorbed in meditative concentration, they are absorbed in those meditative concentrations while dedicating them to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of meditative concentration. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ཞིང་ཤེས་རབ་དེ་བསྒོམ་སྟེ།
en: Subhūti, if you ask how bodhisattva great beings will complete the cultivation of the perfection of wisdom, in this regard, Subhūti, when bodhisattva great beings cultivate the perfection of wisdom, they cultivate that wisdom while dedicating it to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: It is in this manner, Subhūti, that bodhisattva great beings will complete the cultivation of the perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how will bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of ethical discipline?” {Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཚེ། སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་ལུས་ཀྱི་ལས་དང་། བྱམས་པའི་ངག་གི་ལས་དང་།
en: V: 84} “In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dispense their gifts, dedicating them to all-aspect omniscience, they affirm on behalf of beings those physical acts of loving kindness, those verbal acts of loving kindness, and those mental acts of loving kindness.

source: བྱམས་པའི་ཡིད་ཀྱི་ལས་ཉེ་བར་གནས་པར་འགྱུར་ཏེ།
en: When they dispense their gifts, miserliness does not arise. Indeed, they dedicate those gifts toward all-aspect omniscience.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: At that time, bodhisattva great beings acquire the perfection of ethical discipline.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of tolerance?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། ལེན་པ་རྣམས་གཤེ་ཞིང་འཁྱལ་ལ་ཚུལ་མ་ཡིན་པའི་ཚིག་རྩུབ་པོས་མི་སྙན་པར་བརྗོད་ཀྱང་། དེ་དེ་དག་ལ་གནོད་པའི་སེམས་མི་སྐྱེད་དེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dispense their gifts, even though recipients may scold and revile them with disingenuous reprimands and harsh words, they will not develop a mindset that is inimical to them.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, after abiding in the perfection of generosity, acquire the perfection of tolerance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of perseverance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། ལེན་པ་དེ་དག་གཤེ་ཞིང་འཁྱལ་ལ་ཚུལ་མ་ཡིན་པའི་ཚིག་རྩུབ་པོས་མི་སྙན་པར་བརྗོད་དོ། དེ་ལྟར་སྤྱོ་བ་དང་། ཀྱལ་པ་དང་། ཚུལ་མ་ཡིན་པའི་ཚིག་རྩུབ་པོས་མི་སྙན་པར་བརྗོད་ཀྱང་སྦྱིན་པའི་བློ་དང་ཡོངས་སུ་གཏོང་བའི་བློ་ཉིད་དུ་འགྱུར་ཏེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dispense their gifts, even though recipients may scold or revile them with disingenuous reprimands and harsh words, they resort to their generous attitude and their charitable attitude.

source: བདག་གིས་ནི་སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བྱ་སྟེ། བདག་གིས་སྦྱིན་པ་ཡོངས་སུ་མི་གཏང་བར་མི་བྱའོ་ཞེས་དེ་ལུས་དང་སེམས་ཀྱིས་བརྩོན་འགྲུས་སྐྱེད་དེ།
en: They develop physical and mental perseverance, [thinking] that they themselves should not desist from dispensing gifts.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of perseverance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of meditative concentration?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོའི།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dispense their gifts, they do not dedicate them to the level of the śrāvakas, or to the level of the pratyekabuddhas.

source: གཞན་དུ་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དེའི་སེམས་འཇུག་སྟེ།
en: Rather, they set their minds on all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of meditative concentration.” {

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: V: 85} “Blessed Lord, how will bodhisattva great beings, while dispensing generosity with skill in means, acquire the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་ཞིང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། དེ་རྟག་ཏུ་སྦྱིན་པ་ལ་སྒྱུ་མའི་བློ་ཉེ་བར་གནས་ཤིང་སྦྱིན་པ་དེས་སེམས་ཅན་གང་ལ་ཡང་ཕན་པ་འམ་མི་ཕན་པར་གྱུར་པ་མི་མཐོང་སྟེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings offer gifts and dispense their gifts, they invariably maintain an illusion-like attitude. They do not discern that any beings are benefited or harmed by these gifts.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of generosity, acquire the perfection of wisdom.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་གཅིག་པའོ།། །།
en: This completes the fifty-first chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Chapter 52 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how will bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of generosity?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་ནི། ལུས་སམ། ངག་གམ། སེམས་ཀྱི་སྡོམ་པ་གང་ཡང་རུང་སྟེ། སྡོམ་པ་དེས་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་རེག་པར་མི་བྱེད་དེ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings who dwell in the perfection of ethical discipline, owing to whatever vows pertaining to body, speech, and mind [that they maintain], do not make contact with the level of the śrāvakas or the level of the pratyekabuddhas.

source: དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་སྲོག་མི་གཅོད་དོ། །མ་བྱིན་པར་མི་ལེན་ཏོ། །འདོད་པས་ལོག་པར་མི་གཡེམ་མོ། །བརྫུན་གྱི་ཚིག་མི་སྨྲའོ། །ཕྲ་མའི་ཚིག་མི་སྨྲའོ། །ཞེ་གཅོད་པའི་ཚིག་རྩུབ་པོ་མི་སྨྲའོ། །ཚིག་ཀྱལ་པ་མི་སྨྲའོ། །ཆགས་སེམས་སུ་མི་བྱེད་དོ། །གནོད་སེམས་སུ་མི་བྱེད་དོ། །ལོག་པར་མི་ལྟའོ།
en: Abiding in the perfection of ethical discipline, they do not kill living creatures, they do not steal that which is not given, they do not commit acts of sexual misconduct, they do not tell lies, they do not slander, they do not speak harsh words of reprimand, they do not speak nonsensically, they do not become covetous, they do not become malicious, and they do not resort to wrong views.

source: །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གནས་ཤིང་། ཟས་འདོད་པ་ལ་ཟས། སྐོམ་འདོད་པ་ལ་སྐོམ། བཞོན་པ་འདོད་པ་ལ་བཞོན་པ། གོས་འདོད་པ་ལ་གོས། མེ་ཏོག་འདོད་པ་ལ་མེ་ཏོག། །ཕྲེང་བ་འདོད་པ་ལ་ཕྲེང་བ། སྤོས་འདོད་པ་ལ་སྤོས། བྱུག་པ་འདོད་པ་ལ་བྱུག་པ། མལ་ཆ་འདོད་པ་ལ་མལ་ཆ། གནས་འདོད་པ་ལ་གནས།
en: Abiding in this perfection of ethical discipline, they dispense food to those who need food, drink to those who need drink, transport to those who need transport, clothing to those who need clothing, flowers to those who need flowers, garlands to those who need garlands, incense to those who need incense, unguents to those who need unguents, bedding to those who need bedding, sanctuary to those who need sanctuary, sustenance to those who need sustenance, and resources to those who need resources.

source: འཚོ་བ་འདོད་པ་ལ་འཚོ་བ། ཡོ་བྱད་འདོད་པ་ལ་ཡོ་བྱད་ཡོངས་སུ་གཏོང་བ་ནས། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་འདོད་པ་རྣམས་ལ་མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བ་དག་ཡོངས་སུ་གཏོང་ཞིང་། སྦྱིན་པ་དེ་ལྟར་གཏོང་བའི་ཚེ། སྦྱིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: They dispense all sorts of things that are useful to human beings to those who need them, and when dispensing those gifts in that manner, they dedicate their gifts, making common cause with all beings, toward unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །དེ་ཡང་ཅི་ནས་ཀྱང་བསྔོ་བ་དེས་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: They make these dedications by all means and make them in such a way that they do not resort to the level of the śrāvakas or the level of the pratyekabuddhas.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is this way, Subhūti, that bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of generosity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of tolerance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པའི་དྲུང་དུ་སེམས་ཅན་ཐམས་ཅད་ལྷགས་ནས་ཡན་ལག་དང་། ཉིང་ལག་རྣམས་གཅད་གཏུབས་ཏེ་དོང་ཡང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཁྲུག་པ་མེད་དེ། གནོད་པའི་སེམས་གཅིག་ཀྱང་མི་སྐྱེད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “even if all beings were to approach bodhisattva great beings who dwell in the perfection of ethical discipline, cut off their limbs and appendages, and then depart, those bodhisattva great beings would not get angry with them, nor would they have a single thought of malice.

source: །གཞན་དུ་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Rather, they would think, {Ki.

source: དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བདག་གི་ཡན་ལག་དང་། ཉིང་ལག་རྣམས་གཅད་གཏུབས་ཏེ།
en: V: 86} ‘It has been beneficial to me that all these beings have cut off my limbs and appendages and then departed!

source: དོང་བ་ནི་བདག་གིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་བོ། །བདག་གི་ལུས་རུལ་བ་འདི་ཡོངས་སུ་བཏང་བས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལྷ་རྫས་ཀྱི་རྡོ་རྗེ་ལས་བྱུང་བ་ཐོབ་པར་བྱའོ་སྙམ་སྟེ།
en: Through my renunciation of this rotten body, I shall attain the body of a tathāgata, which originates from the indestructible reality of divine substance!’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of tolerance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of perseverance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་སེམས་ཅན་ཐམས་ཅད་བདག་གིས་འཁོར་བ་ལས་བསྒྲལ་ཏེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings dwell in the perfection of ethical discipline, they do not slack in their physical or mental perseverance, thinking, ‘I shall liberate all beings from cyclic existence!

source: འཆི་བ་མེད་པའི་དབྱིངས་སུ་དགོད་པར་བྱའོ་ཞེས་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་ཅིང་།
en: I shall establish them in the deathless expanse!’

source: དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ། ཅི་ནས་ཀྱང་གང་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བའི་བློ་རྣམ་པ་གསུམ་དུ་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: They also dedicate those roots of virtuous action to unsurpassed, complete enlightenment, and they make this dedication in such a way that whatever happens they do not resort to the threefold mental interaction between the one who makes the dedication, the dedication that is made, and the one to whom the dedication is made.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ། །གསོལ་པ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of perseverance.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་གཉིས་པ་དང་།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of meditative concentration?” “

source: བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་དང་། འགོག་པའི་བར་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་དམིགས་པ་མེད་དེ།
en: In this regard, Subhūti,” replied the Blessed One, “at the time when bodhisattva great beings become absorbed in the first meditative concentration, become absorbed in the second, third, and fourth meditative concentrations, and become absorbed in [the other formless absorptions], up to and including cessation, they do not apprehend the level of the śrāvakas or the level of the pratyekabuddhas, and they will, provisionally, not realize the very limit of reality.

source: གཞན་དུ་ན་དེ་འདི་སྙམ་དུ་བདག་གིས་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་འཁོར་བ་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ་སྙམ་སྟེ།
en: Rather, they think, ‘Abiding in this perfection of meditative stability, I shall liberate all beings from cyclic existence!’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of ethical discipline, acquire the perfection of meditative concentration.” “
